app/Models/ModelAgenda.php

    public function AllData()
    {
        return $this->db->table($this->table)->get()->getResultArray();
---
SELECT *
FROM `tbl_agenda`

    public function updateData($id, $data)
    {
        return $this->db->table($this->table)->where($this->primaryKey, $id)->update($data);
---
UPDATE `tbl_agenda` SET `nama_kegiatan` = 'Kajian Rutin (Seninan)', `tanggal` = '2025-04-21', `jam` = '19:30:41'
WHERE `id_agenda` = '2'