app/Models/ModelTahun.php

SELECT *
FROM `tbl_tahun`
---
    public function AllData()
    {
        return $this->findAll(); // Gantikan semua db->table