app/Models/ModelKasMasjid.php

SELECT *
FROM `tbl_kas_masjid`
ORDER BY `id_kas` DESC
---
    public function AllData()
    {
        return $this->db->table($this->table)
                        ->orderBy('id_kas', 'DESC')
                        ->get()
                        ->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE month(tanggal) = '6'
AND year(tanggal) = '2025'
---
        public function AllDataBulanan($bulan, $tahun)
    {
        return $this->db->table('tbl_kas_masjid')
                        ->where('month(tanggal)', $bulan)
                        ->where('year(tanggal)', $tahun)
                        ->get()->getResultArray();