app/Models/ModelKasSosial.php

    public function AllData()
    {
        return $this->db->table('tbl_kas_sosial')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_kas_sosial`

    public function InsertKasKeluar($data)
    {
        $this->db->table('tbl_kas_sosial')->insert($data);
---
INSERT INTO `tbl_kas_sosial` (`tanggal`, `ket`, `kas_masuk`, `kas_keluar`, `status`) VALUES ('2025-06-17', 'ddfdv', 0, '08789', 'Keluar')