app/Models/ModelUser.php

    public function getAllUser()
    {
        return $this->orderBy('id_user', 'DESC')->findAll();
---
SELECT *
FROM `tbl_user`
ORDER BY `id_user` DESC