app/Models/ModelKasMasjid.php

SELECT *
FROM `tbl_kas_masjid`
---
    public function AllData()
    {
        return $this->db->table('tbl_kas_masjid')
        ->get()->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE `status` = 'Masuk'
---
    public function AllDataKasMasuk()
    {
        return $this->db->table('tbl_kas_masjid')
        ->where('status', 'Masuk')
        ->get()->getResultArray();

SELECT *
FROM `tbl_kas_masjid`
WHERE `status` = 'Keluar'
---
    public function AllDataKasKeluar()
    {
        return $this->db->table('tbl_kas_masjid')
        ->where('status', 'Keluar')
        ->get()->getResultArray();

UPDATE `tbl_kas_masjid` SET `id_kas` = '4', `tanggal` = '2025-05-22', `ket` = 'Infak Masjid', `kas_masuk` = '170000'
WHERE `id_kas` = '4'
---
    public function UpdateKasMasuk($data)
    {
        $this->db->table('tbl_kas_masjid')
            ->where('id_kas', $data['id_kas'])
            ->update($data);