app/Models/ModelHome.php

    public function Agenda()
    {
        return $this->db->table('tbl_agenda')
        ->where('month(tanggal)', date('m'))
        ->where('year(tanggal)', date('Y'))
        ->orderBy('tanggal','ASC')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_agenda`
WHERE month(tanggal) = '06'
AND year(tanggal) = '2025'
ORDER BY `tanggal` ASC