app/Models/ModelRekening.php

SELECT *
FROM `tbl_rekening`
---
    public function AllData()
    {
        return $this->db->table($this->table)->get()->getResultArray();